BAS BMEKZU Project/src/Documents/СправкаОДоходах/СправкаОДоходах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СправкаОДоходах</name>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСправки</name>
    <type>
      <types>EnumRef.ВидыСправокОДоходах</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СовокупныйДоход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удержания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоОблагаемое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предел</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОсновное</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСовместительство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоПрочее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Алименты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КалендарныеДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВзносы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаемоеЕСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаемоеЕСВПредел</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходВоенныйСбор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВоенныйСбор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходЗаВычетомНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПрочее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВзносов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ВидыСправокОДоходах/ВидыСправокОДоходах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСправокОДоходах</name>
  <enumValues>
    <name>Произвольная</name>
  </enumValues>
  <enumValues>
    <name>Пенсия2015</name>
  </enumValues>
  <enumValues>
    <name>Соцстрах</name>
  </enumValues>
  <enumValues>
    <name>Безработица</name>
  </enumValues>
  <enumValues>
    <name>Пенсия</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоходыИНалоги</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоцстрах2015</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСубсидия2015</name>
  </enumValues>
  <enumValues>
    <name>Субсидия</name>
  </enumValues>
  <enumValues>
    <name>Соцстрах2015</name>
  </enumValues>
  <enumValues>
    <name>Субсидия2015</name>
  </enumValues>
  <enumValues>
    <name>ДоходыИНалоги</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/СправкаОДоходах/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
		ЗначенияДляЗаполнения.Вставить("Ответственный",	"Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		УстановитьДоступностьЭлементов();
		
		УстановитьФункциональныеОпцииФормы();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьДоступностьЭлементов();

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСправкиПриИзменении(Элемент)
	
	ВидСправкиПриИзмененииНаСервере();
	УстановитьДоступностьЭлементов()

КонецПроцедуры

&НаКлиенте
Процедура НазначениеСправкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастроитьПечатнуюФормуСправкиОДоходах(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ВидСправки = ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах") 
		ИЛИ Объект.ВидСправки = ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Субсидия") 
		ИЛИ Объект.ВидСправки = ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Безработица") 
		Тогда
		ТекстСообщения = НСтр("ru='Выбрана устаревшая форма справки!';uk='Обрана застаріла форма довідки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	Если Объект.Доходы.Количество() > 0 Тогда
	
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?';uk='Перед заповненням таблична частина буде очищена. Заповнити?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
        Возврат; 
		
	КонецЕсли;

	ЗаполнитьПослеЗавершения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов()
	
	Если Объект.Доходы.Количество() > 0 Тогда
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.Отображать;
	Иначе
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
	
	Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;
	Элементы.Сотрудник.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;
	Элементы.ВидСправки.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы() 
	
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Объект.Организация);
	
	ПараметрыФО = Новый Структура("Организация", ГоловнаяОрганизация);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличнуюЧасть()
	
	Объект.Доходы.Очистить();
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	//Отключаем видимость всех элементов
	ЭтаФорма.Элементы.НазначениеСправки.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыОтработаноДней.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыПредел.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатОсновное.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатСовместительство.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСовокупныйДоход.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСуммаКВыплате.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыУдержания.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоЗП.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоПрочее.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыАлименты.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыКалендарныеДни.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВзносы.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходНДФЛ.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНДФЛ.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыОблагаемоеЕСВ.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыОблагаемоеЕСВПредел.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВыплачено.Видимость = Ложь;
		
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходВоенныйСбор.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВоенныйСбор.Видимость = Ложь;
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходЗаВычетомНДФЛ.Видимость = Ложь;

	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНДФЛПрочее.Видимость = Ложь;
	
	ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСтавкаВзносов.Видимость = Ложь;
	
	//Включаем видимость нужных элементов
	Если Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Произвольная Тогда
		
		ЭтаФорма.Элементы.НазначениеСправки.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСовокупныйДоход.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСуммаКВыплате.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыУдержания.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Соцстрах Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыОтработаноДней.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыПредел.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатОсновное.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатСовместительство.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Безработица Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Доступность = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыПредел.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыКалендарныеДни.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВзносы.Видимость = Истина;	
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Пенсия Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Субсидия Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСовокупныйДоход.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоЗП.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоПрочее.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыАлименты.Видимость = Истина;
	
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.ДоходыИНалоги Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВзносы.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходНДФЛ.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНДФЛ.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходВоенныйСбор.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВоенныйСбор.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыДоходЗаВычетомНДФЛ.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Субсидия2015 Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСовокупныйДоход.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоЗП.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНачисленоПрочее.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНДФЛ.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыНДФЛПрочее.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыАлименты.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Соцстрах2015 Тогда	
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыКалендарныеДни.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВзносы.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСтавкаВзносов.Видимость = Истина;

	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Соцстрах2023 Тогда	
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыКалендарныеДни.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВзносы.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыСтавкаВзносов.Видимость = Истина;
		
	ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокОДоходах.Пенсия2015 Тогда
		
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыВсегоОблагаемое.Видимость = Истина;
		ЭтаФорма.Элементы.Доходы.ПодчиненныеЭлементы.ДоходыРезультатВсего.Видимость = Истина;
		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.Автозаполнение();
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    Объект.Доходы.Очистить();
    
    ЗаполнитьПослеЗавершения();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПослеЗавершения()
    
    ЗаполнитьНаСервере();
    ПослеЗаполненияНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаполненияНаСервере()
	
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ОчиститьТабличныеЧасти();
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	ОчиститьТабличныеЧасти();
КонецПроцедуры

&НаСервере
Процедура ВидСправкиПриИзмененииНаСервере()
	ОчиститьТабличныеЧасти();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныеЧасти()
	
	Объект.Доходы.Очистить();
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
